Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/separation_and_divorce/factors_in_separation_divorce.html.txt.tmx
Source language: en
Languages: ga

source: Factors considered by a court in a separation/divorce/dissolution
ga: Gnéithe a thugann an cúirt san áireamh i gcásanna scaradh/ colscaradh/díscaoilte

source: In granting a decree of judicial separation, divorce or dissolution, a court has the power to make a wide variety of ancillary orders
ga: Le foraithne scartha dhlíthúil, colscartha nó díscaoilte a cheadú, tá cumhacht ag an gcúirt réimse leathan ordaithe cúntacha a dhéanamh

source: The most usual court orders relate to the following:
ga: Is dóibh seo a leanas a bhaineann na gnáth ordaithe cúirte:

source: • Custody of and access to children
ga: • Cúram agus teacht ar na bpáistí

source: • Maintenance and lump sum payments
ga: • Íocaíochtaí cothaithe agus cnapshuimeanna

source: • Ownership of the family/shared home
ga: • Úinéireacht ar theach an teaghlaigh/áras comhroinnte

source: • Occupation of the family/shared home
ga: • Cónaí i dteach an teaghlaigh

source: • Ownership of property and assets such as shares
ga: • Úinéireacht ar mhaoin agus ar shócmhainní ar nós scaireanna

source: There is no standard or usual amount of maintenance payable just as there is no standard set of circumstances in which a court will make a particular order in relation to the family or shared home
ga: • An t-ionchur a bhí, agus a d'fhéadhfadh a bheith,ag an mbeirt lánúin ar leas an teaghlaigh - san áireamh tá aon chabhair a tugadh a mhéadaigh ioncam agus achmhainní airgeadais an pháirtí eile
